----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\samso\Google Drive\University of Notre Dame\Spring 2020\Econometri
> cs II\Writing Assignment\Stata\convert_data.log
  log type:  text
 opened on:  22 Apr 2020, 09:45:35

. 
. 
. 
. 
. **************************************************************************
. *                                                                                     
>                                                            *
. *        PART I: CONVERTING THE 62-COUNTRY DATASETS INTO STATA FORMAT            *
. *                                                                                     
>                                                            *
. **************************************************************************
. 
. *trade62
. infile country_code trade using "C:\Users\samso\Google Drive\University of Notre Dame\
> Spring 2020\Econometrics II\Writing Assignment\Data\tablelist\trade62.dat"
(3,782 observations read)

. save "C:\Users\samso\Google Drive\University of Notre Dame\Spring 2020\Econometrics II
> \Writing Assignment\Stata\trade62.dta", replace
file C:\Users\samso\Google Drive\University of Notre Dame\Spring 2020\Econometrics II\Wr
> iting Assignment\Stata\trade62.dta saved

. clear

. 
. *dist62
. infile country_code dist adj using "C:\Users\samso\Google Drive\University of Notre Da
> me\Spring 2020\Econometrics II\Writing Assignment\Data\tablelist\dist62.dat"
(3,782 observations read)

. save "C:\Users\samso\Google Drive\University of Notre Dame\Spring 2020\Econometrics II
> \Writing Assignment\Stata\dist62.dta", replace
file C:\Users\samso\Google Drive\University of Notre Dame\Spring 2020\Econometrics II\Wr
> iting Assignment\Stata\dist62.dta saved

. clear

. 
. *var62i
. infile country_code gdpi locki worki areai using "C:\Users\samso\Google Drive\Universi
> ty of Notre Dame\Spring 2020\Econometrics II\Writing Assignment\Data\tablelist\var62i.
> dat"
(3,782 observations read)

. save "C:\Users\samso\Google Drive\University of Notre Dame\Spring 2020\Econometrics II
> \Writing Assignment\Stata\var62i.dta", replace
file C:\Users\samso\Google Drive\University of Notre Dame\Spring 2020\Econometrics II\Wr
> iting Assignment\Stata\var62i.dta saved

. clear

. 
. *var62j
. infile country_code gdpj lockj workj areaj using "C:\Users\samso\Google Drive\Universi
> ty of Notre Dame\Spring 2020\Econometrics II\Writing Assignment\Data\tablelist\var62j.
> dat"
(3,782 observations read)

. save "C:\Users\samso\Google Drive\University of Notre Dame\Spring 2020\Econometrics II
> \Writing Assignment\Stata\var62j.dta", replace
file C:\Users\samso\Google Drive\University of Notre Dame\Spring 2020\Econometrics II\Wr
> iting Assignment\Stata\var62j.dta saved

. clear

. 
. 
. **************************************************************************
. *                                                                                     
>                                                            *
. *                PART II: PREPARING THE 62-COUNTRY DATASETS FOR MERGING               
>    *
. *                                                                                     
>                                                            *
. **************************************************************************
. 
. 
. * I then add the 'country_code' variable in the datasets trade62.dta 
. * and dist62.dta to the remaining datasets just for the purpose of merging
. * them all. This is done manually. I drop country_code afterwards.
. 
. 
. 
. **************************************************************************
. *                                                                                     
>                                                            *
. *                         PART III: MERGING THE 62-COUNTRY DATASETS                   
>                    *
. *                                                                                     
>                                                            *
. **************************************************************************
. 
. use trade62

. merge 1:1 country_code using "C:\Users\samso\Google Drive\University of Notre Dame\Spr
> ing 2020\Econometrics II\Writing Assignment\Stata\dist62.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,782  (_merge==3)
    -----------------------------------------

. drop _merge

. save "C:\Users\samso\Google Drive\University of Notre Dame\Spring 2020\Econometrics II
> \Writing Assignment\Stata\table1.dta", replace
file C:\Users\samso\Google Drive\University of Notre Dame\Spring 2020\Econometrics II\Wr
> iting Assignment\Stata\table1.dta saved

. merge 1:1 country_code using "C:\Users\samso\Google Drive\University of Notre Dame\Spr
> ing 2020\Econometrics II\Writing Assignment\Stata\var62i.dta"
variable country_code does not uniquely identify observations in the using data
r(459);

end of do-file

r(459);

. exit, clear
